wayta-load-tests/artillery/test.yml
config:
  target: "https://wayta-throughput-engine-rbac-v3.ai.studio"
  phases:
    - name: "Ramp 0 to 50 req/sec over 2 min"
      duration: 120
      arrivalRate: 1
      rampTo: 50
  http:
    timeout: 30
  ensure:
    maxErrorRate: 5   # optional: fail run if >5% of requests error
scenarios:
  - name: "Origin homepage GET"
    flow:
      - get:
          url: "/"